In [ ]:
# Oh maybe we could just pick out each of the samples from each of them and use that...Then also extend to the other datasets.

# So yeah - let's feed ChatGPT and see what scripts it could generate for me

In [30]:
import json

# Step 1: Read both JSON files and load the data into memory
with open('../spider/train_spider.json') as f:
    spiderDataPoints = json.load(f)

with open('../sql_create_context_v4.json') as f:
    sqlCreateContextPoints = json.load(f)

In [31]:
print(len(spiderDataPoints))

7000

In [32]:
import sqlparse

def normalize_query(query):
    # Lowercase the query
    query = query.lower()
    
    # Parse and format the query to normalize the spacing
    parsed_query = sqlparse.parse(query)
    normalized_query = " ".join([sqlparse.format(str(stmt), strip_comments=True, strip_whitespace=True) for stmt in parsed_query])
    
    return normalized_query

# Test the function
query = "SELECT count(*) FROM pets WHERE weight  >  10"
normalized_query = normalize_query(query)
print(normalized_query)

select count(*) from pets where weight > 10

In [33]:
for createContextItem in sqlCreateContextPoints:
    if "answer" in createContextItem:
        # print(item1["answer"])
        createContextItem["normalised"] = normalize_query(createContextItem["answer"])

for spiderItem in spiderDataPoints:
    if "query" in spiderItem:
        # print(item2["query"])
        spiderItem["normalised"] = normalize_query(spiderItem["query"])

In [34]:
sqlCreateContextPoints

[{'question': 'How many heads of the departments are older than 56 ?',
  'context': 'CREATE TABLE head (age INTEGER)',
  'answer': 'SELECT COUNT(*) FROM head WHERE age > 56',
  'normalised': 'select count(*) from head where age > 56'},
 {'question': 'List the name, born state and age of the heads of departments ordered by age.',
  'context': 'CREATE TABLE head (name VARCHAR, born_state VARCHAR, age VARCHAR)',
  'answer': 'SELECT name, born_state, age FROM head ORDER BY age',
  'normalised': 'select name, born_state, age from head order by age'},
 {'question': 'List the creation year, name and budget of each department.',
  'context': 'CREATE TABLE department (creation VARCHAR, name VARCHAR, budget_in_billions VARCHAR)',
  'answer': 'SELECT creation, name, budget_in_billions FROM department',
  'normalised': 'select creation, name, budget_in_billions from department'},
 {'question': 'What are the maximum and minimum budget of the departments?',
  'context': 'CREATE TABLE department (budget_in_billions INTEGER)',
  'answer': 'SELECT MAX(budget_in_billions), MIN(budget_in_billions) FROM department',
  'normalised': 'select max(budget_in_billions), min(budget_in_billions) from department'},
 {'question': 'What is the average number of employees of the departments whose rank is between 10 and 15?',
  'context': 'CREATE TABLE department (num_employees INTEGER, ranking INTEGER)',
  'answer': 'SELECT AVG(num_employees) FROM department WHERE ranking BETWEEN 10 AND 15',
  'normalised': 'select avg(num_employees) from department where ranking between 10 and 15'},
 {'question': 'What are the names of the heads who are born outside the California state?',
  'context': 'CREATE TABLE head (name VARCHAR, born_state VARCHAR)',
  'answer': "SELECT name FROM head WHERE born_state <> 'California'",
  'normalised': "select name from head where born_state <> 'california'"},
 {'question': "What are the distinct creation years of the departments managed by a secretary born in state 'Alabama'?",
  'context': 'CREATE TABLE department (creation VARCHAR, department_id VARCHAR); CREATE TABLE management (department_id VARCHAR, head_id VARCHAR); CREATE TABLE head (head_id VARCHAR, born_state VARCHAR)',
  'answer': "SELECT DISTINCT T1.creation FROM department AS T1 JOIN management AS T2 ON T1.department_id = T2.department_id JOIN head AS T3 ON T2.head_id = T3.head_id WHERE T3.born_state = 'Alabama'",
  'normalised': "select distinct t1.creation from department as t1 join management as t2 on t1.department_id = t2.department_id join head as t3 on t2.head_id = t3.head_id where t3.born_state = 'alabama'"},
 {'question': 'What are the names of the states where at least 3 heads were born?',
  'context': 'CREATE TABLE head (born_state VARCHAR)',
  'answer': 'SELECT born_state FROM head GROUP BY born_state HAVING COUNT(*) >= 3',
  'normalised': 'select born_state from head group by born_state having count(*) >= 3'},
 {'question': 'In which year were most departments established?',
  'context': 'CREATE TABLE department (creation VARCHAR)',
  'answer': 'SELECT creation FROM department GROUP BY creation ORDER BY COUNT(*) DESC LIMIT 1',
  'normalised': 'select creation from department group by creation order by count(*) desc limit 1'},
 {'question': "Show the name and number of employees for the departments managed by heads whose temporary acting value is 'Yes'?",
  'context': 'CREATE TABLE management (department_id VARCHAR, temporary_acting VARCHAR); CREATE TABLE department (name VARCHAR, num_employees VARCHAR, department_id VARCHAR)',
  'answer': "SELECT T1.name, T1.num_employees FROM department AS T1 JOIN management AS T2 ON T1.department_id = T2.department_id WHERE T2.temporary_acting = 'Yes'",
  'normalised': "select t1.name, t1.num_employees from department as t1 join management as t2 on t1.department_id = t2.department_id where t2.temporary_acting = 'yes'"},
 {'question': 'How many acting statuses are there?',
  'context': 'CREATE TABLE management (temporary_acting VARCHAR)',
  'answer': 'SELECT COUNT(DISTINCT temporary_acting) FROM management',
  'normalised': 'select count(distinct temporary_acting) from management'},
 {'question': 'How many departments are led by heads who are not mentioned?',
  'context': 'CREATE TABLE management (department_id VARCHAR); CREATE TABLE department (department_id VARCHAR)',
  'answer': 'SELECT COUNT(*) FROM department WHERE NOT department_id IN (SELECT department_id FROM management)',
  'normalised': 'select count(*) from department where not department_id in (select department_id from management)'},
 {'question': 'What are the distinct ages of the heads who are acting?',
  'context': 'CREATE TABLE head (age VARCHAR, head_id VARCHAR); CREATE TABLE management (head_id VARCHAR, temporary_acting VARCHAR)',
  'answer': "SELECT DISTINCT T1.age FROM management AS T2 JOIN head AS T1 ON T1.head_id = T2.head_id WHERE T2.temporary_acting = 'Yes'",
  'normalised': "select distinct t1.age from management as t2 join head as t1 on t1.head_id = t2.head_id where t2.temporary_acting = 'yes'"},
 {'question': "List the states where both the secretary of 'Treasury' department and the secretary of 'Homeland Security' were born.",
  'context': 'CREATE TABLE management (department_id VARCHAR, head_id VARCHAR); CREATE TABLE head (born_state VARCHAR, head_id VARCHAR); CREATE TABLE department (department_id VARCHAR, name VARCHAR)',
  'answer': "SELECT T3.born_state FROM department AS T1 JOIN management AS T2 ON T1.department_id = T2.department_id JOIN head AS T3 ON T2.head_id = T3.head_id WHERE T1.name = 'Treasury' INTERSECT SELECT T3.born_state FROM department AS T1 JOIN management AS T2 ON T1.department_id = T2.department_id JOIN head AS T3 ON T2.head_id = T3.head_id WHERE T1.name = 'Homeland Security'",
  'normalised': "select t3.born_state from department as t1 join management as t2 on t1.department_id = t2.department_id join head as t3 on t2.head_id = t3.head_id where t1.name = 'treasury' intersect select t3.born_state from department as t1 join management as t2 on t1.department_id = t2.department_id join head as t3 on t2.head_id = t3.head_id where t1.name = 'homeland security'"},
 {'question': 'Which department has more than 1 head at a time? List the id, name and the number of heads.',
  'context': 'CREATE TABLE management (department_id VARCHAR); CREATE TABLE department (department_id VARCHAR, name VARCHAR)',
  'answer': 'SELECT T1.department_id, T1.name, COUNT(*) FROM management AS T2 JOIN department AS T1 ON T1.department_id = T2.department_id GROUP BY T1.department_id HAVING COUNT(*) > 1',
  'normalised': 'select t1.department_id, t1.name, count(*) from management as t2 join department as t1 on t1.department_id = t2.department_id group by t1.department_id having count(*) > 1'},
 {'question': "Which head's name has the substring 'Ha'? List the id and name.",
  'context': 'CREATE TABLE head (head_id VARCHAR, name VARCHAR)',
  'answer': "SELECT head_id, name FROM head WHERE name LIKE '%Ha%'",
  'normalised': "select head_id, name from head where name like '%ha%'"},
 {'question': 'How many farms are there?',
  'context': 'CREATE TABLE farm (Id VARCHAR)',
  'answer': 'SELECT COUNT(*) FROM farm',
  'normalised': 'select count(*) from farm'},
 {'question': 'List the total number of horses on farms in ascending order.',
  'context': 'CREATE TABLE farm (Total_Horses VARCHAR)',
  'answer': 'SELECT Total_Horses FROM farm ORDER BY Total_Horses',
  'normalised': 'select total_horses from farm order by total_horses'},
 {'question': 'What are the hosts of competitions whose theme is not "Aliens"?',
  'context': 'CREATE TABLE farm_competition (Hosts VARCHAR, Theme VARCHAR)',
  'answer': "SELECT Hosts FROM farm_competition WHERE Theme <> 'Aliens'",
  'normalised': "select hosts from farm_competition where theme <> 'aliens'"},
 {'question': 'What are the themes of farm competitions sorted by year in ascending order?',
  'context': 'CREATE TABLE farm_competition (Theme VARCHAR, YEAR VARCHAR)',
  'answer': 'SELECT Theme FROM farm_competition ORDER BY YEAR',
  'normalised': 'select theme from farm_competition order by year'},
 {'question': 'What is the average number of working horses of farms with more than 5000 total number of horses?',
  'context': 'CREATE TABLE farm (Working_Horses INTEGER, Total_Horses INTEGER)',
  'answer': 'SELECT AVG(Working_Horses) FROM farm WHERE Total_Horses > 5000',
  'normalised': 'select avg(working_horses) from farm where total_horses > 5000'},
 {'question': 'What are the maximum and minimum number of cows across all farms.',
  'context': 'CREATE TABLE farm (Cows INTEGER)',
  'answer': 'SELECT MAX(Cows), MIN(Cows) FROM farm',
  'normalised': 'select max(cows), min(cows) from farm'},
 {'question': 'How many different statuses do cities have?',
  'context': 'CREATE TABLE city (Status VARCHAR)',
  'answer': 'SELECT COUNT(DISTINCT Status) FROM city',
  'normalised': 'select count(distinct status) from city'},
 {'question': 'List official names of cities in descending order of population.',
  'context': 'CREATE TABLE city (Official_Name VARCHAR, Population VARCHAR)',
  'answer': 'SELECT Official_Name FROM city ORDER BY Population DESC',
  'normalised': 'select official_name from city order by population desc'},
 {'question': 'List the official name and status of the city with the largest population.',
  'context': 'CREATE TABLE city (Official_Name VARCHAR, Status VARCHAR, Population VARCHAR)',
  'answer': 'SELECT Official_Name, Status FROM city ORDER BY Population DESC LIMIT 1',
  'normalised': 'select official_name, status from city order by population desc limit 1'},
 {'question': 'Show the years and the official names of the host cities of competitions.',
  'context': 'CREATE TABLE city (Official_Name VARCHAR, City_ID VARCHAR); CREATE TABLE farm_competition (Year VARCHAR, Host_city_ID VARCHAR)',
  'answer': 'SELECT T2.Year, T1.Official_Name FROM city AS T1 JOIN farm_competition AS T2 ON T1.City_ID = T2.Host_city_ID',
  'normalised': 'select t2.year, t1.official_name from city as t1 join farm_competition as t2 on t1.city_id = t2.host_city_id'},
 {'question': 'Show the official names of the cities that have hosted more than one competition.',
  'context': 'CREATE TABLE farm_competition (Host_city_ID VARCHAR); CREATE TABLE city (Official_Name VARCHAR, City_ID VARCHAR)',
  'answer': 'SELECT T1.Official_Name FROM city AS T1 JOIN farm_competition AS T2 ON T1.City_ID = T2.Host_city_ID GROUP BY T2.Host_city_ID HAVING COUNT(*) > 1',
  'normalised': 'select t1.official_name from city as t1 join farm_competition as t2 on t1.city_id = t2.host_city_id group by t2.host_city_id having count(*) > 1'},
 {'question': 'Show the status of the city that has hosted the greatest number of competitions.',
  'context': 'CREATE TABLE city (Status VARCHAR, City_ID VARCHAR); CREATE TABLE farm_competition (Host_city_ID VARCHAR)',
  'answer': 'SELECT T1.Status FROM city AS T1 JOIN farm_competition AS T2 ON T1.City_ID = T2.Host_city_ID GROUP BY T2.Host_city_ID ORDER BY COUNT(*) DESC LIMIT 1',
  'normalised': 'select t1.status from city as t1 join farm_competition as t2 on t1.city_id = t2.host_city_id group by t2.host_city_id order by count(*) desc limit 1'},
 {'question': 'Please show the themes of competitions with host cities having populations larger than 1000.',
  'context': 'CREATE TABLE city (City_ID VARCHAR, Population INTEGER); CREATE TABLE farm_competition (Theme VARCHAR, Host_city_ID VARCHAR)',
  'answer': 'SELECT T2.Theme FROM city AS T1 JOIN farm_competition AS T2 ON T1.City_ID = T2.Host_city_ID WHERE T1.Population > 1000',
  'normalised': 'select t2.theme from city as t1 join farm_competition as t2 on t1.city_id = t2.host_city_id where t1.population > 1000'},
 {'question': 'Please show the different statuses of cities and the average population of cities with each status.',
  'context': 'CREATE TABLE city (Status VARCHAR, Population INTEGER)',
  'answer': 'SELECT Status, AVG(Population) FROM city GROUP BY Status',
  'normalised': 'select status, avg(population) from city group by status'},
 {'question': 'Please show the different statuses, ordered by the number of cities that have each.',
  'context': 'CREATE TABLE city (Status VARCHAR)',
  'answer': 'SELECT Status FROM city GROUP BY Status ORDER BY COUNT(*)',
  'normalised': 'select status from city group by status order by count(*)'},
 {'question': 'List the most common type of Status across cities.',
  'context': 'CREATE TABLE city (Status VARCHAR)',
  'answer': 'SELECT Status FROM city GROUP BY Status ORDER BY COUNT(*) DESC LIMIT 1',
  'normalised': 'select status from city group by status order by count(*) desc limit 1'},
 {'question': 'List the official names of cities that have not held any competition.',
  'context': 'CREATE TABLE farm_competition (Official_Name VARCHAR, City_ID VARCHAR, Host_city_ID VARCHAR); CREATE TABLE city (Official_Name VARCHAR, City_ID VARCHAR, Host_city_ID VARCHAR)',
  'answer': 'SELECT Official_Name FROM city WHERE NOT City_ID IN (SELECT Host_city_ID FROM farm_competition)',
  'normalised': 'select official_name from city where not city_id in (select host_city_id from farm_competition)'},
 {'question': 'Show the status shared by cities with population bigger than 1500 and smaller than 500.',
  'context': 'CREATE TABLE city (Status VARCHAR, Population INTEGER)',
  'answer': 'SELECT Status FROM city WHERE Population > 1500 INTERSECT SELECT Status FROM city WHERE Population < 500',
  'normalised': 'select status from city where population > 1500 intersect select status from city where population < 500'},
 {'question': 'Find the official names of cities with population bigger than 1500 or smaller than 500.',
  'context': 'CREATE TABLE city (Official_Name VARCHAR, Population VARCHAR)',
  'answer': 'SELECT Official_Name FROM city WHERE Population > 1500 OR Population < 500',
  'normalised': 'select official_name from city where population > 1500 or population < 500'},
 {'question': 'Show the census ranking of cities whose status are not "Village".',
  'context': 'CREATE TABLE city (Census_Ranking VARCHAR, Status VARCHAR)',
  'answer': 'SELECT Census_Ranking FROM city WHERE Status <> "Village"',
  'normalised': 'select census_ranking from city where status <> "village"'},
 {'question': 'which course has most number of registered students?',
  'context': 'CREATE TABLE courses (course_name VARCHAR, course_id VARCHAR); CREATE TABLE student_course_registrations (course_Id VARCHAR)',
  'answer': 'SELECT T1.course_name FROM courses AS T1 JOIN student_course_registrations AS T2 ON T1.course_id = T2.course_Id GROUP BY T1.course_id ORDER BY COUNT(*) DESC LIMIT 1',
  'normalised': 'select t1.course_name from courses as t1 join student_course_registrations as t2 on t1.course_id = t2.course_id group by t1.course_id order by count(*) desc limit 1'},
 {'question': 'what is id of students who registered some courses but the least number of courses in these students?',
  'context': 'CREATE TABLE student_course_registrations (student_id VARCHAR)',
  'answer': 'SELECT student_id FROM student_course_registrations GROUP BY student_id ORDER BY COUNT(*) LIMIT 1',
  'normalised': 'select student_id from student_course_registrations group by student_id order by count(*) limit 1'},
 {'question': 'what are the first name and last name of all candidates?',
  'context': 'CREATE TABLE candidates (candidate_id VARCHAR); CREATE TABLE people (first_name VARCHAR, last_name VARCHAR, person_id VARCHAR)',
  'answer': 'SELECT T2.first_name, T2.last_name FROM candidates AS T1 JOIN people AS T2 ON T1.candidate_id = T2.person_id',
  'normalised': 'select t2.first_name, t2.last_name from candidates as t1 join people as t2 on t1.candidate_id = t2.person_id'},
 {'question': 'List the id of students who never attends courses?',
  'context': 'CREATE TABLE student_course_attendance (student_id VARCHAR); CREATE TABLE students (student_id VARCHAR)',
  'answer': 'SELECT student_id FROM students WHERE NOT student_id IN (SELECT student_id FROM student_course_attendance)',
  'normalised': 'select student_id from students where not student_id in (select student_id from student_course_attendance)'},
 {'question': 'List the id of students who attended some courses?',
  'context': 'CREATE TABLE student_course_attendance (student_id VARCHAR)',
  'answer': 'SELECT student_id FROM student_course_attendance',
  'normalised': 'select student_id from student_course_attendance'},
 {'question': 'What are the ids of all students for courses and what are the names of those courses?',
  'context': 'CREATE TABLE courses (course_name VARCHAR, course_id VARCHAR); CREATE TABLE student_course_registrations (student_id VARCHAR, course_id VARCHAR)',
  'answer': 'SELECT T1.student_id, T2.course_name FROM student_course_registrations AS T1 JOIN courses AS T2 ON T1.course_id = T2.course_id',
  'normalised': 'select t1.student_id, t2.course_name from student_course_registrations as t1 join courses as t2 on t1.course_id = t2.course_id'},
 {'question': 'What is detail of the student who most recently registered course?',
  'context': 'CREATE TABLE student_course_registrations (student_id VARCHAR, registration_date VARCHAR); CREATE TABLE students (student_details VARCHAR, student_id VARCHAR)',
  'answer': 'SELECT T2.student_details FROM student_course_registrations AS T1 JOIN students AS T2 ON T1.student_id = T2.student_id ORDER BY T1.registration_date DESC LIMIT 1',
  'normalised': 'select t2.student_details from student_course_registrations as t1 join students as t2 on t1.student_id = t2.student_id order by t1.registration_date desc limit 1'},
 {'question': 'How many students attend course English?',
  'context': 'CREATE TABLE student_course_attendance (course_id VARCHAR); CREATE TABLE courses (course_id VARCHAR, course_name VARCHAR)',
  'answer': 'SELECT COUNT(*) FROM courses AS T1 JOIN student_course_attendance AS T2 ON T1.course_id = T2.course_id WHERE T1.course_name = "English"',
  'normalised': 'select count(*) from courses as t1 join student_course_attendance as t2 on t1.course_id = t2.course_id where t1.course_name = "english"'},
 {'question': 'How many courses do the student whose id is 171 attend?',
  'context': 'CREATE TABLE courses (course_id VARCHAR); CREATE TABLE student_course_attendance (course_id VARCHAR, student_id VARCHAR)',
  'answer': 'SELECT COUNT(*) FROM courses AS T1 JOIN student_course_attendance AS T2 ON T1.course_id = T2.course_id WHERE T2.student_id = 171',
  'normalised': 'select count(*) from courses as t1 join student_course_attendance as t2 on t1.course_id = t2.course_id where t2.student_id = 171'},
 {'question': 'Find id of the candidate whose email is stanley.monahan@example.org?',
  'context': 'CREATE TABLE candidates (candidate_id VARCHAR); CREATE TABLE people (person_id VARCHAR, email_address VARCHAR)',
  'answer': 'SELECT T2.candidate_id FROM people AS T1 JOIN candidates AS T2 ON T1.person_id = T2.candidate_id WHERE T1.email_address = "stanley.monahan@example.org"',
  'normalised': 'select t2.candidate_id from people as t1 join candidates as t2 on t1.person_id = t2.candidate_id where t1.email_address = "stanley.monahan@example.org"'},
 {'question': 'Find id of the candidate who most recently accessed the course?',
  'context': 'CREATE TABLE candidate_assessments (candidate_id VARCHAR, assessment_date VARCHAR)',
  'answer': 'SELECT candidate_id FROM candidate_assessments ORDER BY assessment_date DESC LIMIT 1',
  'normalised': 'select candidate_id from candidate_assessments order by assessment_date desc limit 1'},
 {'question': 'What is detail of the student who registered the most number of courses?',
  'context': 'CREATE TABLE students (student_details VARCHAR, student_id VARCHAR); CREATE TABLE student_course_registrations (student_id VARCHAR)',

In [35]:


# Step 2 and 3: Iterate over each object in the second JSON file, 
# extract the "query" attribute, and find the matching object in the first JSON file
new_list = []
for spiderItem in spiderDataPoints:
    spiderItemNormalised = spiderItem.get("normalised")
    spiderQuestion = spiderItem.get("question")
    # print(query2)
    foundQuery2 = False
    for createContextItem in sqlCreateContextPoints:
        createContextItemNormalised = createContextItem.get("normalised")
        createContextQuestion = createContextItem.get("question")
        # print(answer1)
        if (spiderItemNormalised == createContextItemNormalised or spiderQuestion == createContextQuestion):
            createContextItem["db_id"] = spiderItem["db_id"]
            createContextItem["question"] = spiderItem["question"]
            createContextItem["answer"] = spiderItem["query"]

            print(createContextItem["db_id"])
            new_list.append(createContextItem)
            sqlCreateContextPoints.remove(createContextItem) 
            foundQuery2 = True
            break
    if not foundQuery2:
        print("Could not find a match for: " + spiderItemNormalised + " " + spiderQuestion)

department_management
department_management
department_management
department_management
department_management
department_management
department_management
department_management
department_management
department_management
department_management
department_management
department_management
department_management
department_management
department_management
farm
Could not find a match for: select count(*) from farm Count the number of farms.
farm
Could not find a match for: select total_horses from farm order by total_horses asc What is the total horses record for each farm, sorted ascending?
farm
Could not find a match for: select hosts from farm_competition where theme != 'aliens' Return the hosts of competitions for which the theme is not Aliens?
farm
Could not find a match for: select theme from farm_competition order by year asc Return the themes of farm competitions, sorted by year ascending.
farm
Could not find a match for: select avg(working_horses) from farm where total_horses > 5000 Give the average number of working horses on farms with more than 5000 total horses.
farm
Could not find a match for: select max(cows), min(cows) from farm Return the maximum and minimum number of cows across all farms.
farm
Could not find a match for: select count(distinct status) from city Count the number of different statuses.
farm
Could not find a match for: select official_name from city order by population desc What are the official names of cities, ordered descending by population?
farm
Could not find a match for: select official_name, status from city order by population desc limit 1 What is the official name and status of the city with the most residents?
farm
Could not find a match for: select t2.year, t1.official_name from city as t1 join farm_competition as t2 on t1.city_id = t2.host_city_id Give the years and official names of the cities of each competition.
farm
Could not find a match for: select t1.official_name from city as t1 join farm_competition as t2 on t1.city_id = t2.host_city_id group by t2.host_city_id having count(*) > 1 What are the official names of cities that have hosted more than one competition?
farm
Could not find a match for: select t1.status from city as t1 join farm_competition as t2 on t1.city_id = t2.host_city_id group by t2.host_city_id order by count(*) desc limit 1 What is the status of the city that has hosted the most competitions?
farm
Could not find a match for: select t2.theme from city as t1 join farm_competition as t2 on t1.city_id = t2.host_city_id where t1.population > 1000 What are the themes of competitions that have corresponding host cities with more than 1000 residents?
farm
Could not find a match for: select status, avg(population) from city group by status What are the statuses and average populations of each city?
farm
Could not find a match for: select status from city group by status order by count(*) asc Return the different statuses of cities, ascending by frequency.
farm
Could not find a match for: select status from city group by status order by count(*) desc limit 1 What is the most common status across all cities?
farm
Could not find a match for: select official_name from city where city_id not in (select host_city_id from farm_competition) What are the official names of cities that have not hosted a farm competition?
farm
Could not find a match for: select status from city where population > 1500 intersect select status from city where population < 500 Which statuses correspond to both cities that have a population over 1500 and cities that have a population lower than 500?
farm
Could not find a match for: select official_name from city where population > 1500 or population < 500 What are the official names of cities that have population over 1500 or less than 500?
farm
Could not find a match for: select census_ranking from city where status != "village" What are the census rankings of cities that do not have the status "Village"?
student_assessment
Could not find a match for: select t1.course_name from courses as t1 join student_course_registrations as t2 on t1.course_id = t2.course_id group by t1.course_id order by count(*) desc limit 1 What is the name of the course with the most registered students?
student_assessment
Could not find a match for: select student_id from student_course_registrations group by student_id order by count(*) limit 1 What are the ids of the students who registered for some courses but had the least number of courses for all students?
student_assessment
Could not find a match for: select t2.first_name, t2.last_name from candidates as t1 join people as t2 on t1.candidate_id = t2.person_id What are the first and last names of all the candidates?
student_assessment
Could not find a match for: select student_id from students where student_id not in (select student_id from student_course_attendance) What are the  ids of every student who has never attended a course?
student_assessment
Could not find a match for: select student_id from student_course_attendance What are the ids of all students who have attended at least one course?
student_assessment
student_assessment
Could not find a match for: select t2.student_details from student_course_registrations as t1 join students as t2 on t1.student_id = t2.student_id order by t1.registration_date desc limit 1 What details do we have on the students who registered for courses most recently?
student_assessment
Could not find a match for: select count(*) from courses as t1 join student_course_attendance as t2 on t1.course_id = t2.course_id where t1.course_name = "english" How many students are attending English courses?
student_assessment
Could not find a match for: select count(*) from courses as t1 join student_course_attendance as t2 on t1.course_id = t2.course_id where t2.student_id = 171 How many courses does the student with id 171 actually attend?
student_assessment
Could not find a match for: select t2.candidate_id from people as t1 join candidates as t2 on t1.person_id = t2.candidate_id where t1.email_address = "stanley.monahan@example.org" What is the id of the candidate whose email is stanley.monahan@example.org?
student_assessment
Could not find a match for: select candidate_id from candidate_assessments order by assessment_date desc limit 1 What is the id of the candidate who most recently accessed the course?
student_assessment
Could not find a match for: select t1.student_details from students as t1 join student_course_registrations as t2 on t1.student_id = t2.student_id group by t1.student_id order by count(*) desc limit 1 What are the details of the student who registered for the most number of courses?
student_assessment
Could not find a match for: select t1.student_id, count(*) from students as t1 join student_course_registrations as t2 on t1.student_id = t2.student_id group by t1.student_id For every student who is registered for some course, how many courses are they registered for?
student_assessment
Could not find a match for: select t3.course_name, count(*) from students as t1 join student_course_registrations as t2 on t1.student_id = t2.student_id join courses as t3 on t2.course_id = t3.course_id group by t2.course_id For each course id, how many students are registered and what are the course names?
student_assessment
Could not find a match for: select candidate_id from candidate_assessments where asessment_outcome_code = "pass" What are the ids of the candidates that have an outcome code of Pass?
student_assessment
Could not find a match for: select t3.cell_mobile_number from candidates as t1 join candidate_assessments as t2 on t1.candidate_id = t2.candidate_id join people as t3 on t1.candidate_id = t3.person_id where t2.asessment_outcome_code = "fail" What are the cell phone numbers of the candidates that received an assessment code of "Fail"?
student_assessment
Could not find a match for: select student_id from student_course_attendance where course_id = 301 What are the ids of the students who registered for course 301?
student_assessment
Could not find a match for: select student_id from student_course_attendance where course_id = 301 order by date_of_attendance desc limit 1 What are the ids of the students who registered for course 301 most recently?
student_assessment
Could not find a match for: select distinct t1.city from addresses as t1 join people_addresses as t2 on t1.address_id = t2.address_id What are the different cities where people live?
student_assessment
Could not find a match for: select distinct t1.city from addresses as t1 join people_addresses as t2 on t1.address_id = t2.address_id join students as t3 on t2.person_id = t3.student_id What are the different cities where students live?
student_assessment
Could not find a match for: select course_name from courses order by course_name What are the names of the courses in alphabetical order?
student_assessment
Could not find a match for: select first_name from people order by first_name What are the first names of the people in alphabetical order?
student_assessment
Could not find a match for: select student_id from student_course_registrations union select student_id from student_course_attendance What are the ids of the students who either registered or attended a course?
student_assessment
Could not find a match for: select course_id from student_course_registrations where student_id = 121 union select course_id from student_course_attendance where student_id = 121 What are the ids of the courses that are registered or attended by the student whose id is 121?
student_assessment
Could not find a match for: select * from student_course_registrations where student_id not in (select student_id from student_course_attendance) What are all details of the students who registered but did not attend any course?
student_assessment
Could not find a match for: select t2.student_id from courses as t1 join student_course_registrations as t2 on t1.course_id = t2.course_id where t1.course_name = "statistics" order by t2.registration_date What are the ids of the students who registered course statistics by order of registration date?
student_assessment
Could not find a match for: select t2.student_id from courses as t1 join student_course_attendance as t2 on t1.course_id = t2.course_id where t1.course_name = "statistics" order by t2.date_of_attendance What are the ids of the students who attended courses in the statistics department in order of attendance date.
bike_1
Could not find a match for: select date from weather where max_temperature_f > 85 What are the dates with a maximum temperature higher than 85?
bike_1
Could not find a match for: select name from station where lat < 37.5 What are the names of all stations with a latitude smaller than 37.5?
bike_1
Could not find a match for: select city, max(lat) from station group by city For each city, what is the highest latitude for its stations?
bike_1
Could not find a match for: select start_station_name, end_station_name from trip order by id limit 3 What is the station station and end station for the trips with the three smallest ids?
bike_1
Could not find a match for: select avg(lat), avg(long) from station where city = "san jose" What is the average latitude and longitude in San Jose?
bike_1
Could not find a match for: select id from trip order by duration limit 1 What is the id of the shortest trip?
bike_1
Could not find a match for: select sum(duration), max(duration) from trip where bike_id = 636 What is the total and maximum duration for all trips with the bike id 636?
bike_1
Could not find a match for: select zip_code , avg(mean_temperature_f) from weather where date like "8/%" group by zip_code For each zip code, what is the average mean temperature for all dates that start with '8'?
bike_1
Could not find a match for: select count(distinct bike_id) from trip How many different bike ids are there?
bike_1
Could not find a match for: select count(distinct city) from station How many different cities have these stations?
bike_1
Could not find a match for: select count(*) from station where city = "mountain view" How many stations are in Mountain View?
bike_1
Could not find a match for: select distinct t1.name from station as t1 join status as t2 on t1.id = t2.station_id where t2.bikes_available = 7 What are the different names for each station that has ever had 7 bikes available?
bike_1
Could not find a match for: select start_station_name, start_station_id from trip where start_date like "8/%" group by start_station_name order by count(*) desc limit 1 What are the start station's name and id for the one that had the most start trips in August?
bike_1
Could not find a match for: select bike_id from trip where zip_code = 94002 group by bike_id order by count(*) desc limit 1 What is the id of the bike that traveled the most in 94002?
bike_1
Could not find a match for: select count(*) from weather where mean_humidity > 50 and mean_visibility_miles > 8 What is the number of days that had an average humity above 50 and an average visibility above 8?
bike_1
Could not find a match for: select t1.lat, t1.long, t1.city from station as t1 join trip as t2 on t1.id = t2.start_station_id order by t2.duration limit 1 What is the latitude, longitude, and city of the station from which the trip with smallest duration started?
bike_1
Could not find a match for: select id from station where city = "san francisco" intersect select station_id from status group by station_id having avg(bikes_available) > 10 What are the ids of the stations in San Francisco that normally have more than 10 bikes available?
bike_1
Could not find a match for: select t1.name, t1.id from station as t1 join status as t2 on t1.id = t2.station_id group by t2.station_id having avg(t2.bikes_available) > 14 union select name, id from station where installation_date like "12/%" What are the names and ids of all stations that have more than 14 bikes available on average or had bikes installed in December?
bike_1
Could not find a match for: select cloud_cover from weather where zip_code = 94107 group by cloud_cover order by count (*) desc limit 3 What are the 3 most common cloud covers in the zip code of 94107?
bike_1
Could not find a match for: select zip_code from weather group by zip_code order by avg(mean_sea_level_pressure_inches) limit 1 What is the zip code that has the lowest average mean sea level pressure?
bike_1
Could not find a match for: select avg(bikes_available) from status where station_id not in (select id from station where city = "palo alto") What is the average bike availablility for stations not in Palo Alto?
bike_1
Could not find a match for: select avg(long) from station where id not in (select station_id from status group by station_id having max(bikes_available) > 10) What is the mean longitude for all stations that have never had more than 10 bikes available?
bike_1
Could not find a match for: select date , zip_code from weather where max_temperature_f >= 80 What zip codes have a station with a max temperature greater than or equal to 80 and when did it reach that temperature?
bike_1
Could not find a match for: select t1.id from trip as t1 join weather as t2 on t1.zip_code = t2.zip_code group by t2.zip_code having avg(t2.mean_temperature_f) > 60 For each zip code, find the ids of all trips that have a higher average mean temperature above 60?
bike_1
Could not find a match for: select zip_code, count(*) from weather where max_wind_speed_mph >= 25 group by zip_code For each zip code, how many times has the maximum wind speed reached 25 mph?
bike_1
Could not find a match for: select date , zip_code from weather where min_dew_point_f < (select min(min_dew_point_f) from weather where zip_code = 94107) Which days had a minimum dew point smaller than any day in zip code 94107, and in which zip codes were those measurements taken?
bike_1
Could not find a match for: select t1.id, t2.installation_date from trip as t1 join station as t2 on t1.end_station_id = t2.id What is the installation date for each ending station on all the trips?
bike_1
Could not find a match for: select t1.id from trip as t1 join station as t2 on t1.start_station_id = t2.id order by t2.dock_count desc limit 1 What is the id of the trip that started from the station with the highest dock count?
bike_1
Could not find a match for: select count(*) from trip as t1 join station as t2 on t1.end_station_id = t2.id where t2.city != "san francisco" How many trips did not end in San Francisco?
bike_1
Could not find a match for: select date from weather where zip_code = 94107 and events != "fog" and events != "rain" On which day has it neither been foggy nor rained in the zip code of 94107?
bike_1
Could not find a match for: select id from station where lat > 37.4 except select station_id from status group by station_id having min(bikes_available) < 7 What are the ids of all stations that have a latitude above 37.4 and have never had less than 7 bikes available?
bike_1
Could not find a match for: select t1.name from station as t1 join status as t2 on t1.id = t2.station_id group by t2.station_id having avg(bikes_available) > 10 except select name from station where city = "san jose" What are the names of all stations that have more than 10 bikes available and are not located in San Jose?
bike_1
Could not find a match for: select name, lat, city from station order by lat limit 1 What is the name, latitude, and city of the station that is located the furthest South?
bike_1
Could not find a match for: select date , mean_temperature_f, mean_humidity from weather order by max_gust_speed_mph desc limit 3 What is the date, average temperature and mean humidity for the days with the 3 largest maximum gust speeds?
bike_1
Could not find a match for: select city, count(*) from station group by city having count(*) >= 15 What is the name of every city that has at least 15 stations and how many stations does it have?
bike_1
Could not find a match for: select start_station_id, start_station_name from trip group by start_station_name having count(*) >= 200 What are the ids and names of all start stations that were the beginning of at least 200 trips?
bike_1
Could not find a match for: select zip_code from weather group by zip_code having avg(mean_visibility_miles) < 10 For each zip code, select all those that have an average mean visiblity below 10.
bike_1
Could not find a match for: select city from station group by city order by max(lat) desc For each city, list their names in decreasing order by their highest station latitude.
bike_1
Could not find a match for: select date , cloud_cover from weather order by cloud_cover desc limit 5 What are the dates that have the 5 highest cloud cover rates and what are the rates?
bike_1
Could not find a match for: select id, duration from trip order by duration desc limit 3 What are the ids of the trips that lasted the longest and how long did they last?
bike_1
Could not find a match for: select t1.name, t1.long, avg(t2.duration) from station as t1 join trip as t2 on t1.id = t2.start_station_id group by t2.start_station_id For each start station id, what is its name, longitude and average duration of trips started there?
bike_1
Could not find a match for: select t1.name, t1.lat, min(t2.duration) from station as t1 join trip as t2 on t1.id = t2.end_station_id group by t2.end_station_id For each end station id, what is its name, latitude, and minimum duration for trips ended there?
bike_1
Could not find a match for: select distinct start_station_name from trip where duration < 100 What are all the different start station names for a trip that lasted less than 100?
bike_1
Could not find a match for: select distinct zip_code from weather except select distinct zip_code from weather where max_dew_point_f >= 70 What are all the different zip codes that have a maximum dew point that was always below 70?
bike_1

In [36]:
print(len(new_list))
print(len(spiderDataPoints))

3961
7000

In [37]:
def remove_normalised_property(obj_list):
    for obj in obj_list:
        if "normalised" in obj:
            del obj["normalised"]
    return obj_list

In [38]:
result_list = remove_normalised_property(new_list)
print(result_list[0])

{'question': 'How many heads of the departments are older than 56 ?', 'context': 'CREATE TABLE head (age INTEGER)', 'answer': 'SELECT count(*) FROM head WHERE age  >  56', 'db_id': 'department_management'}

In [39]:
print(len(new_list))
print(len(spiderDataPoints))

3961
7000

In [40]:
# Step 4: Save the new list to a new JSON file
with open('spider_create_context_train_db_id.json', 'w') as f:
    json.dump(result_list, f, indent=4)

In [64]:
from datasets import load_dataset
import json
import os

# Load the dataset from Hugging Face
dataset = load_dataset('lamini/spider_text_to_sql')

# Create a directory to store the JSON files
os.makedirs('lamini', exist_ok=True)

# Convert the dataset splits to lists of dictionaries
train_data = [dict(item) for item in dataset['train']]
validation_data = [dict(item) for item in dataset['validation']]

# Write the train split to a JSON file
with open('lamini/train.json', 'w') as train_file:
    json.dump(train_data, train_file, ensure_ascii=False, indent=4)

# Write the validation split to a JSON file
with open('lamini/validation.json', 'w') as validation_file:
    json.dump(validation_data, validation_file, ensure_ascii=False, indent=4)

print("Dataset has been downloaded and saved to 'lamini' directory.")

Dataset has been downloaded and saved to 'lamini' directory.